{"keras_version": "2.1.2", "backend": "tensorflow", "config": [{"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "output_dim": 128, "dtype": "float32", "input_length": 1970, "activity_regularizer": null, "input_dim": 5000, "mask_zero": false, "embeddings_constraint": null, "trainable": true, "name": "embedding_1", "batch_input_shape": [null, 1970], "embeddings_regularizer": null}, "class_name": "Embedding"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "unroll": false, "implementation": 1, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "recurrent_dropout": 0.2, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "lstm_1", "activity_regularizer": null, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 192, "dropout": 0.2, "unit_forget_bias": true, "bias_constraint": null, "go_backwards": false, "kernel_constraint": null, "return_sequences": false, "stateful": false}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "units": 128, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "dense_1", "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "units": 256, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "dense_2", "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "seed": null, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "units": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "dense_3", "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "seed": null, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "units": 32, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "dense_4", "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "seed": null, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "units": 8, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "dense_5", "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}